package com.java.practice.jvm.stack;

/**
 * 每个线程都需要一个栈（Stack）空间来保存挂起（suspending）时的状态。
 *
 * 虚拟机栈描述的是java方法执行的内存模型，每个方法执行都会创建一个栈帧，栈帧包含局部变量表、操作数栈、动态连接、方法出口等。
 * 栈帧(Stack Frame)是用于支持虚拟机进行方法调用和方法执行的数据结构，它是虚拟机运行时数据区的虚拟机栈(Virtual Machine Stack)的栈元素。
 *
 * https://juejin.im/post/5db84c79f265da4d2970f034
 */
public class VMStackTests {
    /**
     * 每次方法调用都会新建一个新的栈帧并把它压栈到栈顶。当方法正常返回或者调用过程中抛出未捕获的异常时，栈帧将出栈。更多关于异常处理的细节，可以参考下面的异常信息表章节。
     *
     * 每个栈帧包含：
     *
     * 局部变量数组
     * 返回值
     * 操作数栈
     * 类当前方法的运行时常量池引用
     */

}
